"""
Домашнее задание №09: Итераторы, контейнеры и перечисления
Выполните следующее задание:
Создать генератор списка без исходного и получить список [0, 10, 20, 30, 40, 50, 60, 70, 80, 90]
"""

# Генератор списка
result_list = [x * 10 for x in range(10)]

# Вывод результата
print(result_list)

